In [2]:
import numpy as np
import pandas as pd

In [3]:
df=pd.DataFrame(np.arange(0,28).reshape(7,4),index=["row1","row2","row3","row4","row5","row6","row7"],columns=["column1","column2","column3","column4"])

In [4]:
df.head()

      column1  column2  column3  column4
row1        0        1        2        3
row2        4        5        6        7
row3        8        9       10       11
row4       12       13       14       15
row5       16       17       18       19

In [16]:
df.shape

(7, 4)

In [17]:
df.tail()

      column1  column2  column3  column4
row3        8        9       10       11
row4       12       13       14       15
row5       16       17       18       19
row6       20       21       22       23
row7       24       25       26       27

In [18]:
df.columns

Index(['column1', 'column2', 'column3', 'column4'], dtype='object')

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, row1 to row7
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   column1  7 non-null      int32
 1   column2  7 non-null      int32
 2   column3  7 non-null      int32
 3   column4  7 non-null      int32
dtypes: int32(4)
memory usage: 168.0+ bytes

In [20]:
df.describe()

         column1    column2    column3    column4
count   7.000000   7.000000   7.000000   7.000000
mean   12.000000  13.000000  14.000000  15.000000
std     8.640988   8.640988   8.640988   8.640988
min     0.000000   1.000000   2.000000   3.000000
25%     6.000000   7.000000   8.000000   9.000000
50%    12.000000  13.000000  14.000000  15.000000
75%    18.000000  19.000000  20.000000  21.000000
max    24.000000  25.000000  26.000000  27.000000

In [22]:
df.loc["row1"]

column1    0
column2    1
column3    2
column4    3
Name: row1, dtype: int32

In [23]:
type(df.loc["row1"])

pandas.core.series.Series

In [25]:
df["row2":"row4"]
# df[1:4] same

      column1  column2  column3  column4
row2        4        5        6        7
row3        8        9       10       11
row4       12       13       14       15

In [28]:
df.isnull().sum()

column1    0
column2    0
column3    0
column4    0
dtype: int64

In [38]:
df.iloc[1:,:2]
# same as df.iloc[1:8,0,2]

      column1  column2
row2        4        5
row3        8        9
row4       12       13
row5       16       17
row6       20       21
row7       24       25

In [33]:
#convert Dataframes into array
df.iloc[:,:].values

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19],
       [20, 21, 22, 23],
       [24, 25, 26, 27]])

In [35]:
df['column1'].value_counts()

0     1
4     1
8     1
12    1
16    1
20    1
24    1
Name: column1, dtype: int64

In [47]:
df[df["column1"] > 4]
# df.dtypes

      column1  column2  column3  column4
row3        8        9       10       11
row4       12       13       14       15
row5       16       17       18       19
row6       20       21       22       23
row7       24       25       26       27

In [5]:
df.isnull()

      column1  column2  column3  column4
row1    False    False    False    False
row2    False    False    False    False
row3    False    False    False    False
row4    False    False    False    False
row5    False    False    False    False
row6    False    False    False    False
row7    False    False    False    False

In [6]:
df.isnull

<bound method DataFrame.isnull of       column1  column2  column3  column4
row1        0        1        2        3
row2        4        5        6        7
row3        8        9       10       11
row4       12       13       14       15
row5       16       17       18       19
row6       20       21       22       23
row7       24       25       26       27>

In [9]:
df.isnull().sum()

column1    0
column2    0
column3    0
column4    0
dtype: int64